In [2]:
import pandas as pd

# Create DataFrame

In [2]:
data = { 'month': [1, 4, 7, 10],
         'year': [2012, 2014, 2013, 2014],
         'sale':[55, 40, 84, 31] }
df = pd.DataFrame(data)

# Index operation

In [3]:
df = df.set_index('month')
df

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [4]:
new_df = pd.DataFrame(data)
new_df['new_month'] = df.index
new_df

   month  year  sale  new_month
0      1  2012    55          1
1      4  2014    40          4
2      7  2013    84          7
3     10  2014    31         10

# Filter DataFrame

In [5]:
tmp_df = new_df[new_df['month'] >1].month

# Join table

In [6]:
# join on index(default)
df1 = pd.DataFrame({ 'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                     'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5'],
                     'C': ['C0', 'C1', 'C2', 'C3', 'C4', 'C5']})
df2 = pd.DataFrame({ 'key': ['K0', 'K2', 'K1'],
                     'B': ['B0', 'B2', 'B1']     })
df1.join(df2, lsuffix='df1', rsuffix='df2')

  keydf1   A   C keydf2    B
0     K0  A0  C0     K0   B0
1     K1  A1  C1     K2   B2
2     K2  A2  C2     K1   B1
3     K3  A3  C3    NaN  NaN
4     K4  A4  C4    NaN  NaN
5     K5  A5  C5    NaN  NaN

In [7]:
df1 = df1.set_index('key')
df2 = df2.set_index('key')

In [8]:
df1[['A', 'C']].join(df2[['B']], lsuffix='df1', rsuffix='df2')

      A   C    B
key
K0   A0  C0   B0
K1   A1  C1   B1
K2   A2  C2   B2
K3   A3  C3  NaN
K4   A4  C4  NaN
K5   A5  C5  NaN

In [9]:
df1 ['label'] = df2['B']

In [10]:
df1

      A   C label
key
K0   A0  C0    B0
K1   A1  C1    B1
K2   A2  C2    B2
K3   A3  C3   NaN
K4   A4  C4   NaN
K5   A5  C5   NaN

# List to dataframe

In [11]:
data = [ ['one', 1, 1], ['two', 2, 1], ['three', 3, 1], ['four', 4, 1], ['five', 5, 1] ]

In [12]:
pd.DataFrame(data, columns=['Name', 'Rank', 'Complete'],)#[['Name', 'Rank']]

    Name  Rank  Complete
0    one     1         1
1    two     2         1
2  three     3         1
3   four     4         1
4   five     5         1

In [13]:
data = [ ['one', 1, 1], ['one', 1, 1], ['two', 2, 1], ['three', 3, 1], ['four', 4, 1], ['five', 5, 1] ]

In [16]:
df = pd.DataFrame(data, columns=['Name', 'Rank', 'Complete'])

In [18]:
df.drop_duplicates('Complete')

  Name  Rank  Complete
0  one     1         1

# Column to list

In [24]:
df = pd.DataFrame(data, columns=['Name', 'Rank', 'Complete'])
df['Name'].values

array(['one', 'one', 'two', 'three', 'four', 'five'], dtype=object)

# Pandas fill Nan

In [3]:
# join on index(default)
df1 = pd.DataFrame({ 'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                     'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5'],
                     'C': ['C0', 'C1', 'C2', 'C3', 'C4', 'C5']})
df2 = pd.DataFrame({ 'key': ['K0', 'K2', 'K1'],
                     'B': ['B0', 'B2', 'B1']     })
df = df1.join(df2, lsuffix='df1', rsuffix='df2')
print(df)
df.fillna(0)

  keydf1   A   C keydf2    B
0     K0  A0  C0     K0   B0
1     K1  A1  C1     K2   B2
2     K2  A2  C2     K1   B1
3     K3  A3  C3    NaN  NaN
4     K4  A4  C4    NaN  NaN
5     K5  A5  C5    NaN  NaN

  keydf1   A   C keydf2   B
0     K0  A0  C0     K0  B0
1     K1  A1  C1     K2  B2
2     K2  A2  C2     K1  B1
3     K3  A3  C3      0   0
4     K4  A4  C4      0   0
5     K5  A5  C5      0   0

    A    B   C keydf1
0  A0   B0  C0     K0
1  A1   B2  C1     K1
2  A2   B1  C2     K2
3  A3  NaN  C3     K3
4  A4  NaN  C4     K4
5  A5  NaN  C5     K5